const mockJs = {
  modeA: [
    {
      name: '【献礼建档百年】我能源系统点亮西非港口 几内亚柴光供电项目装上“智慧大脑”',
      type: '海电气集团'
    },
    {
      name: '国内陆上单机容量最大！东方造陆上风电机组开启“6MW时代”',
      type: '东方电气集团'
    },
    {
      name: '哈汽辅机方案亮相第十届国际储能峰会',
      type: '哈电集团'
    },
    {
      name: '太原重工新能源装备有限公司4.5兆瓦样机基础浇筑顺利完成',
      type: '太原重工'
    },
    {
      name: '上海电气数字化产品亮相上交会 市长龚正莅临指导',
      type: '上海新时达电气股份有限公司'
    },
    {
      name: '东方风电FD70-1500型机组叶片技术改造优化方案通过评审',
      type: '东方电气'
    },
    {
      name: '核动力院明星产品亮相第十四届国际核电展“龙”系列反应堆装备产品正式发布',
      type: '核动力院'
    },
    {
      name: '金风科技打造叶片产业链创新技术合作平台 推动行业长足发展',
      type: '新疆金风科技股份有限公司'
    },
    {
      name: '东方电气集团发布大型核电汽轮发电机组自主化成果',
      type: '东方电气'
    },

    {
      name: '世界首创！中国一重携手河北宏润成功调试全奥氏体钢模锻泵壳',
      type: '中国一重集团'
    },
    {
      name: '2020机器人产业发展与技术应用高峰论坛举办',
      type: '上海新时达电气股份有限公司'
    }
  ],
  modeB: [
    {
      name: '双线齐发促业绩增长，产业基金添发展新能',
      type: '[财通证券]',
      time: '2012-04-09'
    },
    {
      name: '硅料利润持续释放，产能扩张坚定推进',
      type: '[财通证券]',
      time: '2012-04-09'
    },
    {
      name: '“碳中和”推升节能需求海内外市场共同发力',
      type: '[东北证券]',
      time: '2012-04-09'
    },
    {
      name: '新能源设备板块利好频传，机床和工程机械行业景气持续',
      type: '[平安证券]',
      time: '2012-04-09'
    },
    {
      name: '2020年年报点评:风机销量大增，海外+大风机顺利拓展',
      type: '[东吴证券]',
      time: '2012-04-09'
    },
    {
      name: '股权回购彰显信心危废龙头行稳致远',
      type: '[华金证券]',
      time: '2012-04-09'
    },
    {
      name: '“碳中和”政策红利受益者市场份额提升增强成长性',
      type: '[平安证券]',
      time: '2012-04-09'
    },
    {
      name: '公司进入边际成本下降阶段，叠加负债率持续下降或进入毛利率拐点',
      type: '[天风证券]',
      time: '2012-04-09'
    },
    {
      name: '风电营收持续增长，公司向新能源方向转型',
      type: '[天风证券]',
      time: '2012-04-09'
    },
    {
      name: '一季度业绩符合预期期待市占率及盈利能力提升',
      type: '[浙商证券]',
      time: '2012-04-09'
    },
    {
      name: '双线齐发促业绩增长，产业基金添发展新能',
      type: '[财通证券]',
      time: '2012-04-09'
    },
    {
      name: '硅料利润持续释放，产能扩张坚定推进',
      type: '[东北证券]',
      time: '2012-04-09'
    },
    {
      name: '“碳中和”推升节能需求海内外市场共同发力',
      type: '[平安证券]',
      time: '2012-04-09'
    },
    {
      name: '新能源设备板块利好频传，机床和工程机械行业景气持续',
      type: '[东吴证券]',
      time: '2012-04-09'
    },
    {
      name: '2020年年报点评:风机销量大增，海外+大风机顺利拓展',
      type: '[华金证券]',
      time: '2012-04-09'
    },
    {
      name: '股权回购彰显信心危废龙头行稳致远',
      type: '[平安证券]',
      time: '2012-04-09'
    },
    {
      name: '公司进入边际成本下降阶段，叠加负债率持续下降或进入毛利率拐点',
      type: '[天风证券]',
      time: '2012-04-09'
    },
    {
      name: '风电营收持续增长，公司向新能源方向转型',
      type: '[天风证券]',
      time: '2012-04-09'
    },
    {
      name: '一季度业绩符合预期期待市占率及盈利能力提升',
      type: '[浙商证券]',
      time: '2012-04-09'
    },
  ],
  modeC: [
    {
      name: '中国华能集团有限公司',
      fuzeren: '舒印彪',
      money: '3,490,000万(元)',
      time: '1989-03-31',
      bt: '投资机构',
      jg: '高新技术产业',
      address: '地址：北京市海淀区复兴路甲23号',
      url: 'https://www.chng.com.cn',
      web: '机械工业信息科学；促进机械工业发展',
      tag:'存续',
      url:'https://www.chng.com.cn'
    },
    {
      name: '国家能源投资集团有限责任公司',
      fuzeren: '李蕊',
      money: '1219万',
      time: '2007-09-18',
      address: '地址：上海市南汇区倚天路185号',
      url: 'www.miic.com.cn',
      web: '机械工业信息科学；促进机械工业发展',
      tag:'存续',
      bt: '投资机构',
    },
    {
      name: '国家电力投资集团有限公司',
      fuzeren: '吴胜利',
      money: '1219万',
      time: '2004-07-08',
      address: '地址：浦东新区万祥镇宏祥北路83弄1-42号15幢A区A160室',
      url: 'www.miic.com.cn',
      web: '机械工业信息科学；促进机械工业发展',
      tag:'存续',
      bt: '投资机构',
    },
    {
      name: '中国大唐集团有限公司',
      fuzeren: '韩烽火',
      money: '500万人民币',
      youxiang: '邮箱：zhonghuajia@highsun-marine.con',
      time: '1994-03-18',
      address: '地址：上海市浦东新区洪山路172号',
      url: 'www.miic.com.cn',
      web: '机械工业信息科学；促进机械工业发展',
      tag:'存续',
      bt: '投资机构',
    },
   {
     name: '中国广核集团有限公司',
     fuzeren: '张怀龙',
     money: '216万人民币',
     time: '1992-12-14',
     address: '地址：中山北一路1250号2号楼1706室',
     url: 'www.miic.com.cn',
     web: '机械工业信息科学；促进机械工业发展',
     tag:'存续',
     bt: '投资机构',
   },
  ]
}

export default mockJs
