const handleObj={
    rightChange:[
      {
        tag:'产业发展研究',
        left: '2021-04-19',
        cen: '发电设备中心',
        rg: '12页',
        rg2: '3积分',
        title:'2019年我国发电设备行业发展情况及2020年展望',
        content:'2019 年我国国民经济运行总体平稳， 结构调整稳步推进，转型升级成效明显 ，宏观经济指标保持在合理区间，但面临明显上升的国内外风险挑战 。 电力需求方面， 2019 年 全国电力生产运行平稳，电力供需总体平衡。'
      },
      {
        tag:'行业形式预测',
        left: '2021-04-19',
        cen: '发电设备中心',
        rg: '11页',
        rg2: '0积分',
        title:'2020年三季度我国发电设备行业生产运行情况分析',
        time:'2021-03-31       中原证券        26页',
        content:'2020年前三季度，面对新冠肺炎疫情巨大冲击和复杂严峻的国内外环境，在中央统筹推进疫情防控和各项政策措施的大力推动下，我国经济增速由负转正，全社会用电情况持续好转。'
      },
      {
        tag:'行业形式预测',
        left: '2021-04-19',
        cen: '发电设备中心',
        rg: '7页',
        rg2: '1积分',
        title:'2020年上半年我国发电设备行业发展情况及形势展望',
        time:'2021-03-26  渤海证券   18页',
        content:'1-6 月 份， 全国 全社会用电量 3.35 万亿千瓦时，同比下降 1.3% 。全国电源工程建设完成投资同比增长 51.5%51.5%，其中水电、风电投资分别增长 25.3%和 152.2%152.2%，火电投资明显减少，下降 31.9%31.9%，核电投资下降...'
      },
      {
        tag:'行业形式预测',
        left: '2021-04-19',
        cen: '发电设备中心',
        rg: '4页',
        rg2: '3积分',
        title:'2020年一季度我国发电设备行业生产运行情况分析',
        time:'2020-11-13  渤海证券   18页',
        content:'发电设备行业科学防控和有序复工复产“两手抓”，成效明显。疫情较严重的1-2月，全国发电设备产量降幅超过30%。3月份发电设备产量单月增幅达20%，主要经济指标也呈现回升势头，降幅明显收窄。'
      },
      {
        tag:'行业形式预测',
        left: '2021-04-19',
        cen: '发电设备中心',
        rg: '19页',
        rg2: '10积分',
        title:'2020-2021年度全国电力供需形势分析预测报告',
        time:'2020-11-13  渤海证券   18页',
        content:'电力行业坚决贯彻落实党中央、国务院决策部署，积极推进电力企业疫情防控和复工复产，为社会疫情防控和复工复产、复商复市提供坚强电力保障；四季度电力消费实现较快增长，经济社会发展对电力的消费需求已恢复常态。'
      },
      {
        tag:'行业形式预测',
        left: '2021-04-19',
        cen: '发电设备中心',
        rg: '25页',
        rg2: '3积分',
        title:'2020年前三季度全国电力供需形势分析预测报告',
        time:'2021-03-26  渤海证券   18页',
        content:'2020年前三季度，面对新冠肺炎疫情巨大冲击和复杂严峻的国内外环境，在以习近平同志为核心的党中央坚强领导下，全国上下科学统筹疫情防控和经济社会发展，有力有效推动生产生活秩序恢复，前三季度国民经济和能源消费增速均...'
      },
    ]
};

export  default  handleObj;
